requestbooking.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://skirental.io/gt/webservice">
    <soapenv:Header>
        <gs:apiKey>Y7Jv3Dq4M1fN8K2sL5xZ9R0wQ6uP4eB7</gs:apiKey>
    </soapenv:Header>
    <soapenv:Body>
        <gs:bookMaterialRequest>
            <gs:transactionId>1234</gs:transactionId>
            <gs:decision>global_commit</gs:decision>
            <gs:orders>
                <gs:stockId>1</gs:stockId>
                <gs:amount>1</gs:amount>
            </gs:orders>
            <gs:orders>
                <gs:stockId>2</gs:stockId>
                <gs:amount>2</gs:amount>
            </gs:orders>
            <gs:orders>
                <gs:stockId>3</gs:stockId>
                <gs:amount>3</gs:amount>
            </gs:orders>
        </gs:bookMaterialRequest>
    </soapenv:Body>
</soapenv:Envelope>